{
  "posts": [
    {
      "id": 1,
      "title": "미스터 션샤인 (Mr. Sunshine)-Netflix",
      "link": "https://www.netflix.com/title/80991107",
      "creator": "user123",
      "img": "https://upload.wikimedia.org/wikipedia/en/a/a5/Mr._Sunshine_%282018_TV_series%29.jpg",
      "text": "Mr. Sunshine is a historical drama which takes place in Joseon as the kingdom struggles to maintain not only its independence, but its very existance. The story revolves around five main characters, each with their own tragic back-story, trying to live and act according to their own unique values and ideals, even as their country is falling apart around them. This is a beautiful romantic work that I have to re-watch at least once a year.",
      "type": "watch",
      "likes": 6,
      "comments": [
        {
          "id": 1,
          "user": "smcvey",
          "text": "이병훈은 너무 멋있다!"
        }
      ]
    },
    {
      "id": 2,
      "title": "The Way of Kings",
      "link": "https://books.apple.com/us/book/the-way-of-kings/id376229549",
      "creator": "smcvey",
      "img": "https://upload.wikimedia.org/wikipedia/en/8/8b/TheWayOfKings.png",
      "text": "This book may look intimidating, and there is a lot to learn about the world that Sanderson has created, but it eases the reader into it all in a natural way. The character are compelling and diverse and are driven by clear values, which in true romantic style, are frequently challenged by thought-provoking dilemmas. The world is unique and stunningly portrayed. A must read!",
      "type": "read",
      "likes": 42,
      "comments": [
        {
          "id": 1,
          "user": "user123",
          "text": "If I were a spren, I think I would be a confusion spren."
        },
        {
          "id": 2,
          "user": "pmcvey",
          "text": "Are there kitten spren?"
        },
        {
          "id": 3,
          "user": "amcherman",
          "text": "You wish pmcvey!"
        },
        {
          "id": 4,
          "user": "pmcherman",
          "text": "I definitely saw a stink spren when I was changing Milo yesterday"
        }
      ]
    },
    {
      "id": 3,
      "title": "The Highwayman",
      "link": "https://www.youtube.com/watch?v=YGFo0xn4JeY",
      "creator": "user123",
      "img": "https://upload.wikimedia.org/wikipedia/en/8/8a/Album_Cover-The_Book_of_Secrets.jpg",
      "text": "I first heard this song in a high school English class, and even though it is not my usual style it really stuck with me. Loreena McKennitt sings this hauntingly beautiful rendition of Alfred Noyes' 1906 narrative poem on her album The Book of Secrets. Taking place in 18th century rural England, it tells the tragic love story of an unnamed highwayman and Bess the daughter of the landlord of an inn. I am amazed at the skill of both the author and the singer at allowing the reader to understand the characters, experience their romance, and to despair at the outcome in just over ten minutes. I can't help coming back to it every so often and having a good cry.",
      "type": "listen",
      "likes": 7,
      "comments": [
        {
          "id": 1,
          "user": "smcvey",
          "text": "Down with King George!"
        }
      ]
    },
    {
      "id": 4,
      "title": "",
      "link": "link",
      "creator": "user123",
      "img": "https://upload.wikimedia.org/wikipedia/en/a/a5/Mr._Sunshine_%282018_TV_series%29.jpg",
      "text": "Mr. Sunshine is a historical drama about Joseon's fight to maintain not only its independence, but its very existance.",
      "type": "watch",
      "likes": 6,
      "comments": [
        {
          "id": 1,
          "user": "smcvey",
          "text": "이병훈은 너무 멋있다!"
        }
      ]
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "user123",
      "password": "password"
    },
    {
      "username": "smcvey",
      "password": "password",
      "id": 2
    },
    {
      "username": "pmcvey",
      "password": "kittens",
      "id": 3
    }
  ]
}